app/Services/UrlShortenerService.php

    public function getMinUrlAndFull(string $url): ?ShortUrl
    {
        return ShortUrl::where('url', $url)->first();
---
select * from `short_urls` where `url` = 'https://github.com/Mantaz/url-shortener' limit 1

    public function createShortUrl(string $hash, array $validInputs): void
    {
        ShortUrl::create([
            'hash' => $hash,
            'url' => $validInputs['url'],
            'folder' => $validInputs['folder'] ?? null
        ]);
---
insert into `short_urls` (`hash`, `url`, `folder`, `updated_at`, `created_at`) values ('Ued1N2', 'https://github.com/Mantaz/url-shortener', '', '2024-03-05 14:26:53', '2024-03-05 14:26:53')

    public function findUrl(string $hash, ?string $folder = null): string
    {
        $shortUrl = ShortUrl::where([
            'folder' => $folder,
            'hash' => $hash
        ])->first();
---
select * from `short_urls` where (`folder` is null and `hash` = 'xTMPI8') limit 1

    public function updateFolder(object $shortUrl, ?string $folder = null): void
    {
        $shortUrl->folder = $folder;
        $shortUrl->save();
---
update `short_urls` set `folder` = 'Nature', `short_urls`.`updated_at` = '2024-03-05 11:35:14' where `id` = 2